Repository: debba/turbosmtp-email-validator-for-woocommerce
Catalog: languages/turbosmtp-email-validator-for-woocommerce-*.po
Languages: it_it

source: Validates email address during WooCommerce registration using turboSMTP API.
it_it: Convalida l'indirizzo email durante la registrazione su WooCommerce utilizzando le API di turboSMTP.

source: Status
it_it: Stato

source: Validated At
it_it: Validato il

source: Please provide a valid email
it_it: Fornisci in un indirizzo email valido

source: The email entered is not valid. Please enter a valid email.
it_it: L'email inserita non è valida. Per favore, inserisci un'email valida.

source: Error in email validation. Please try again later.
it_it: Errore nella validazione dell'email. Per favore, riprova più tardi.

source: Email Validation Settings
it_it: Impostazioni Email Validation

source: Current Subscription
it_it: Abbonamento attuale

source: Remaining Paid Credits
it_it: Crediti a pagamento rimasti

source: Remaining Free Credits
it_it: Crediti gratuiti rimasti

source: Refresh subscription
it_it: Ricarica abbonamento

source: Test Validator
it_it: Test Validatore

source: Verify now
it_it: Verifica ora

source: Validated Emails
it_it: Email Validate

source: Enable Email Validation
it_it: Abilita Validazione Email

source: Search
it_it: Cerca
